// ********************************************************************** ModuleConfig.h *****************************************************************

#if defined(ESP32S3) || defined(CONFIG_IDF_TARGET_ESP32S3) || defined(ARDUINO_ESP32S3_DEV)
// Для ESP32-S3
  #define FIRMWARE_VARIANT 1        // 1 = ESP32-S3 (архив bin_ESP32-S3.zip)
  #define USE_BUTTON 1              // Использовать кнопку: 0 - нет, 1 - да
  #define BUTTON_TYPE 1             // Тип кнопки: 0 - механическая, 1 - сенсорная
  #define USE_IR_RECEIVER 1         // Использовать ИК-приёмник: 0 - нет, 1 - да
  #define USE_RF_RECEIVER 1         // Использовать приёмник 433 МГц: 0 - нет, 1 - да
  #define USE_TM1637 1              // Использовать дисплей TM1637: 0 - нет, 1 - да
  #define USE_ST7789 1              // Использовать дисплей ST7789: 0 - нет, 1 - да
  #define USE_MP3_PLAYER 1          // Использовать MP3-плеер: 0 - нет, 1 - да
  #define USE_SD 1                  // Использовать SD-карту с эффектами формата .out: 0 - нет, 1 - да
  #define SD_TYPE 1                 // Тип SD-карты: 0 - физическая, 1 - эмуляция в LITTLEFS (поменять выбор можно в вэб)
#else
// Для ESP32
  #define FIRMWARE_VARIANT 2        // 2 = ESP32 (архив bin_ESP32.zip)
  #define USE_BUTTON 0              // Использовать кнопку: 0 - нет, 1 - да
  #define BUTTON_TYPE 0             // Тип кнопки: 0 - механическая, 1 - сенсорная
  #define USE_IR_RECEIVER 0         // Использовать ИК-приёмник: 0 - нет, 1 - да
  #define USE_RF_RECEIVER 0         // Использовать приёмник 433 МГц: 0 - нет, 1 - да
  #define USE_TM1637 0              // Использовать дисплей TM1637: 0 - нет, 1 - да
  #define USE_ST7789 0              // Использовать дисплей ST7789: 0 - нет, 1 - да
  #define USE_MP3_PLAYER 0          // Использовать MP3-плеер: 0 - нет, 1 - да
  #define USE_SD 0                  // Использовать только физическую SD-карту с эффектами формата .out: 0 - нет, 1 - да
#endif

// *******************************************************************************************************************************************************
