// ====================================================================== ModuleConfig.h ================================================================

#if defined(ESP32S3) || defined(CONFIG_IDF_TARGET_ESP32S3) || defined(ARDUINO_ESP32S3_DEV)
// Для ESP32-S3
  #define USE_BUTTON 1              // Использовать кнопку: 0 - нет, 1 - да
  #define BUTTON_TYPE 1             // Тип кнопки: 0 - механическая, 1 - сенсорная
  #define USE_IR_RECEIVER 1         // Использовать ИК-приёмник: 0 - нет, 1 - да
  #define USE_RF_RECEIVER 1         // Использовать приёмник 433 МГц: 0 - нет, 1 - да
  #define USE_TM1637 1              // Использовать дисплей TM1637: 0 - нет, 1 - да
  #define USE_ST7789 1              // Использовать дисплей ST7789: 0 - нет, 1 - да
  #define USE_MP3_PLAYER 1          // Использовать MP3-плеер: 0 - нет, 1 - да
// если обновляете файловую систему, то не забудьте сохранить свой mp3 плейлист (sound_list.json) перед загрузкой новой прошивки
#else
// Для ESP32
  #define USE_BUTTON 0              // Использовать кнопку: 0 - нет, 1 - да
  #define BUTTON_TYPE 0             // Тип кнопки: 0 - механическая, 1 - сенсорная
  #define USE_IR_RECEIVER 0         // Использовать ИК-приёмник: 0 - нет, 1 - да
  #define USE_RF_RECEIVER 0         // Использовать приёмник 433 МГц: 0 - нет, 1 - да
  #define USE_TM1637 0              // Использовать дисплей TM1637: 0 - нет, 1 - да
  #define USE_ST7789 0              // Использовать дисплей ST7789: 0 - нет, 1 - да
  #define USE_MP3_PLAYER 0          // Использовать MP3-плеер: 0 - нет, 1 - да
#endif

// *******************************************************************************************************************************************************
