// ************************************************************************ rf_codes.h ***************************************************************

#if USE_RF_RECEIVER
// ---------------------- настройка RF радиопульта 433 МГц -----------------------
// замените коды пульта на реальные коды
//     Константа         код        действие
#define RF_ON_OFF       0x123456  // Вкл/Выкл лампы
#define RF_MUTE         0x123457  // Mute
#define RF_PREV         0x123458  // Предыдущий эффект
#define RF_NEXT         0x123459  // Следующий эффект
#define RF_CYCLE        0x12345A  // Вкл/Выкл избранное
#define RF_BR_UP        0x12345B  // Увеличить яркость
#define RF_BR_DOWN      0x12345C  // Уменьшить яркость
#define RF_SP_UP        0x12345D  // Увеличить скорость
#define RF_SP_DOWN      0x12345E  // Уменьшить скорость
#define RF_SC_UP        0x12345F  // Увеличить масштаб
#define RF_SC_DOWN      0x123460  // Уменьшить масштаб
#define RF_VOL_UP       0x123461  // Увеличить громкость
#define RF_VOL_DOWN     0x123462  // Уменьшить громкость
#define RF_TIME         0x123463  // Произнести время
#define RF_WEATHER      0x123480  // Произнести погоду
#define RF_IP           0x123464  // Показать IP адрес
#define RF_FOLD_PREV    0x123465  // Предыдущая папка MP3
#define RF_FOLD_NEXT    0x123466  // Следующая папка MP3
#define RF_RND          0x123467  // Случайные настройки текущего эффекта
#define RF_DEF          0x123468  // Настройки текущего эффекта по  умолчанию
#define RF_EQ           0x123469  // Эквалайзер
#define RF_FAV_ADD      0x12346A  // Добавить в избранное
#define RF_FAV_DEL      0x12346B  // Удалить из избранного
#define RF_0            0x123470
#define RF_1            0x123471
#define RF_2            0x123472
#define RF_3            0x123473
#define RF_4            0x123474
#define RF_5            0x123475
#define RF_6            0x123476
#define RF_7            0x123477
#define RF_8            0x123478
#define RF_9            0x123479

#endif // USE_RF_RECEIVER

// ******************************************************************************************************************************************************
